ednieuw/Arduino-ESP32-Nano-Wordclock/Old/ESP32_WordClockV120/ESP32_WordClockV120.ino
  sprintf(sptext, "✓ Learned '%s' - Protocol: %s, Command: 0x%04X, Address: 0x%04X", 
          ButtonNames[currentLearningIndex], getProtocolString(protocol), command, address);
  Tekstprintln(sptext);
  currentLearningIndex++;
  if (currentLearningIndex < MAX_BUTTONS)
  {
    sprintf(sptext, "\nPlease press button: %s", ButtonNames[currentLearningIndex]);
    Tekstprintln(sptext);
  }
  else
  {
    learningMode = false;                                                                     // Learning complete
    StoreIRRemoteInFlashMemory();
    Tekstprintln("\n=== Learning Complete & Saved! ===");
    Tekstprintln("\nStored Button Mappings:");
    PrintAllMappings();
    Tekstprintln("\n=== Now in Recognition Mode ===");
    sprintf(sptext, "Only responding to remote with Address: 0x%04X", IRMem.learnedRemoteAddress);
    Tekstprintln(sptext);
    Tekstprintln("Press any learned button to test...\nPress OK to quit test mode\n");
  }
}

//============================================
// IR-RECEIVER Internal function - handles recognition mode
// Validates remote address Calls RecognizeButton
//============================================
void ProcessRecognitionMode(decode_type_t protocol, uint16_t command, uint16_t address)
{
  if (address != IRMem.learnedRemoteAddress || 
     protocol != (decode_type_t) IRMem.learnedRemoteProtocol)                                 // Check if it's from the learned remote
  {
    sprintf(sptext, "⚠ Ignored - Wrong remote (Address: 0x%04X)", address);
    Tekstprintln(sptext);
  }
  else {RecognizeButton(protocol, command, address);  }                                       // Correct remote - identify which button was pressed
}

//--------------------------------------------                                                //
// IR-RECEIVER Initializes learning mode
// Resets all button data, Prompts for first button
//--------------------------------------------
void StartIRLearning()
{
  Tekstprintln("\n=== Starting Learning Mode ===");
  currentLearningIndex = 0;
  learningMode = true;
  IRMem.remoteIdentified = false;
  for (int i = 0; i < MAX_BUTTONS; i++) {IRMem.buttons[i].learned = false; }
  Tekstprintln("Please press button: 0");
}

//--------------------------------------------                                                //
// IR-RECEIVER Identifies button pressed
//--------------------------------------------

//--------------------------------------------                                                //
// IR-RECEIVER Shows learned buttons
//--------------------------------------------
void PrintAllMappings(void)
{
 if (!IRMem.remoteIdentified) {Tekstprintln("No remote learned yet!");  return; }
 PrintLine(35);
 sprintf(sptext, "Remote Address: 0x%04X", IRMem.learnedRemoteAddress);
 Tekstprintln(sptext);
 sprintf(sptext, "Remote Protocol: %s", getProtocolString( (decode_type_t) IRMem.learnedRemoteProtocol));
 Tekstprintln(sptext);
 PrintLine(35);
  for (int i = 0; i < MAX_BUTTONS; i++)
  {
   if (IRMem.buttons[i].learned)
    {
     sprintf(sptext, "%s\t-> Cmd: 0x%04X", ButtonNames[i], IRMem.buttons[i].command);
     Tekstprintln(sptext);     
    }
  }
 PrintLine(35);
}

//--------------------------------------------                                                //
// IR-RECEIVER Reset all settings
//--------------------------------------------
void ResetAllIRremoteSettings()
{
 Tekstprintln("\n=== Resetting All IR remote Data ===");
 IRMem.remoteIdentified = false;
 IRMem.learnedRemoteAddress = 0;
 IRMem.learnedRemoteProtocol = 0;
 for (int i = 0; i < MAX_BUTTONS; i++)
  {
    IRMem.buttons[i].learned = false;
    IRMem.buttons[i].protocol = 0;
    IRMem.buttons[i].command = 0;
    IRMem.buttons[i].address = 0;
  }
  
  StoreIRRemoteInFlashMemory();
  Tekstprintln("✓ IR remote reset complete.");   
  learningMode = false;
}


//--------------------------------------------                                                //
// IR-RECEIVER Identifies button pressed
//--------------------------------------------
int RecognizeButton(decode_type_t protocol, uint16_t command, uint16_t address)
{
  bool found = false;
  for (int i = 0; i < MAX_BUTTONS; i++)
  {
    if (IRMem.buttons[i].learned && 
        IRMem.buttons[i].protocol == (uint8_t)protocol &&
        IRMem.buttons[i].command == command && 
        IRMem.buttons[i].address == address)
    {
      sprintf(sptext, "Button pressed: %s", ButtonNames[i]);
      Tekstprintln(sptext);
      found = true;
      ReworkIRremoteValue(i);
      return i;
    }
  }
  
  if (!found)
  {
    sprintf(sptext, "Unknown button - Protocol: %s, Command: 0x%04X, Address: 0x%04X", 
            getProtocolString(protocol), command, address);
    Tekstprintln(sptext);
    ReworkIRremoteValue(-1);
    return -1;
  } 
 return -1;
}

//--------------------------------------------                                                //
// IR-RECEIVER ReworkRemoteValue
// String ButtonNames[] = {"0", "1", "2", "3", "4", "5", "6", "7", "8", "9",
//                        "UP", "DOWN", "LEFT", "RIGHT", "POWER", "OK"};
//--------------------------------------------
void ReworkIRremoteValue(int ButtonNamesNr)
{
 if (ButtonNamesNr == -1)  {Tekstprintln("Unknown button - ignored");  return;  }
 String ButtonName = ButtonNames[ButtonNamesNr];
 switch(ButtonNamesNr)
  {
    case 0:                                                                                   // Button "0"
    case 1:                                                                                   // Button "1"
    case 2:                                                                                   // Button "2"
    case 3:                                                                                   // Button "3"
    case 4:                                                                                   // Button "4"
    case 5:                                                                                   // Button "5"
    case 6:                                                                                   // Button "6"
    case 7:                                                                                   // Button "7"
    case 8:                                                                                   // Button "8"
    case 9:                                                                                   // Button "9"
      EnteredDigits += ButtonName;                                                            // Add digit to entered string  
      if (EnteredDigits.length() > 6) {EnteredDigits = EnteredDigits.substring(0, 6); }      // Limit to 6 digits (HHMMSS)
      if (EnteredDigits.length() == 6)
      {
        sprintf(sptext, "Time entered: %c%c:%c%c:%c%c (press OK)", 
                EnteredDigits[0], EnteredDigits[1], EnteredDigits[2], 
                EnteredDigits[3], EnteredDigits[4], EnteredDigits[5]);
      }
      else sprintf(sptext, "Digits: %s (Need 6 for HHMMSS)", EnteredDigits.c_str());
      Tekstprintln(sptext);
      break;
    case 10:                                                                                  // Button "UP"
      AdjustTime(1, 0, 0);                                                                    // +1 hour
      break;
    case 11:                                                                                  // Button "DOWN"
      AdjustTime(-1, 0, 0);                                                                   // -1 hour
      break;
    case 12:                                                                                  // Button "LEFT"
      AdjustTime(0, -1, 0);                                                                   // -1 minute
      break;
    case 13:                                                                                  // Button "RIGHT"
      AdjustTime(0, 1, 0);                                                                    // +1 minute
      break;
    case 14:                                                                                  // Button "POWER"
      TogglePower();
      break;
    case 15: 
      learningMode = false;                                                                  // Button "OK"
//      Serial.println(EnteredDigits.length());   
      if (EnteredDigits.length() == 6) {ReworkInputString(EnteredDigits); EnteredDigits = "";}
      else  { Tekstprintln("⚠ Need 6 digits (HHMMSS) before OK");  }
      break;
    default:
      sprintf(sptext, "Button '%s' not yet assigned", ButtonName.c_str());
      Tekstprintln(sptext);
      break;
  }
}

//--------------------------------------------                                                //
// IR-RECEIVER Adjust current time by hours/minutes/seconds
//--------------------------------------------
void AdjustTime(int DeltaHours, int DeltaMinutes, int DeltaSeconds)
{
 timeinfo.tm_hour += DeltaHours;
 timeinfo.tm_min  += DeltaMinutes;
 timeinfo.tm_sec  += DeltaSeconds;
 time_t t = mktime(&timeinfo);
 if(DS3231Installed) 
   {
    sprintf(sptext, "Time set in external RTC module");
    SetDS3231Time();
    PrintDS3231Time();
   }  
 Displaytime();       
}

//--------------------------------------------                                                //
// IR-RECEIVER Toggle power/display on or off
//--------------------------------------------
void TogglePower()
{
  ReworkInputString("O");                                                                     // Toggle LEDs On/Off
}